using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using TextRPG.Entity;

namespace TextRPG.Data
{
    internal class MonsterDB
    {
        //몬스터 딕셔너리
        public static Dictionary<int, Monster> Monsters = new Dictionary<int, Monster>()
        {   //            id  이름            체 공 방 속도 exp gold

            //1컨셉-크레타의 황소와 그 들소 무리
            {1, new Monster(1, "게으른 들소",       20, 20, 1, 1, 20, 50)},
            {2, new Monster(2, "성난 황소",         25, 22, 1, 1, 30, 80)},
            {3, new Monster(3, "화난 버팔로",       30, 25, 3, 1, 40, 100)},

            //2컨셉-
            {4, new Monster(4, "어린 멧돼지",       50, 30, 5, 3, 70, 130)},
            {5, new Monster(5, "건장한 멧돼지",     60, 35, 5, 4, 80, 150)},
            {6, new Monster(6, "노련한 멧돼지",     70, 40, 6, 5, 100, 180)},

            //3컨셉-

            {7, new Monster(7, "부케팔로스",       100, 25, 1, 1, 40, 200)},
            {8, new Monster(8, "적토마",           120, 25, 1, 1, 40, 210)},
            {9, new Monster(9, "라이스샤워",       130, 25, 1, 1, 40, 220)},


            //4컨셉-신성한 사슴과 그 무리

            {10, new Monster(10, "문라이트 래빗",       160, 25, 1, 1, 40, 250)},
            {11, new Monster(11, "문라이트 람쥐",       175, 25, 1, 1, 40, 275)},
            {12, new Monster(12, "문라이트 새도우",     185, 25, 1, 1, 40, 300)},

            //5컨셉-괴물화 된 가축

            {13, new Monster(13, "더러운 별의 흑마",     220, 25, 1, 1, 40, 370)},
            {14, new Monster(14, "더러운 별의 혈우",     230, 25, 1, 1, 40, 400)},
            {15, new Monster(15, "더러운 별의 광견",     240, 25, 1, 1, 40, 430)},

            //6컨셉-청동 괴조 무리

            {16, new Monster(16, "붉은 빛의 괴조",       290, 25, 1, 1, 40, 490)},
            {17, new Monster(17, "푸른 빛의 괴조",       300, 25, 1, 1, 40, 530)},
            {18, new Monster(18, "검은 빛의 괴조",       320, 25, 1, 1, 40, 550)},

            //7컨셉-아마존의 여전사들

            {19, new Monster(19, "아마존의 검사",       380, 25, 1, 1, 40, 600)},
            {20, new Monster(20, "아마존의 궁병",       390, 25, 1, 1, 40, 640)},
            {21, new Monster(21, "아마존의 돌격대장",   400, 25, 1, 1, 40, 680)},

            //8컨셉-네메아의 사자와 사자무리

            {22, new Monster(22, "철갑 사자",       450, 25, 1, 1, 40, 100)},
            {23, new Monster(23, "철조 사자",       470, 25, 1, 1, 40, 100)},
            {24, new Monster(24, "산군",            490, 25, 1, 1, 40, 100)},

            //9컨셉-
            {25, new Monster(25, "괴물 황소A",       550, 25, 1, 1, 40, 100)},
            {26, new Monster(26, "괴물 황소B",       580, 25, 1, 1, 40, 100)},
            {27, new Monster(27, "쌍두견 오르토스",  600, 25, 1, 1, 40, 100)},


            //10컨셉- 히드라가 사는 호수의 물괴물들
            {28, new Monster(28, "독에 물든 갓파",       700, 25, 1, 1, 40, 100)},
            {29, new Monster(29, "독에 물든 정령",       730, 25, 1, 1, 40, 100)},
            {30, new Monster(30, "독에 물든 물뱀",     760, 25, 1, 1, 40, 100)},

            //11컨셉-케르베로스가 지키는 지옥의 입구
            {31, new Monster(31, "지옥의 혼령",       850, 25, 1, 1, 40, 100)},
            {32, new Monster(32, "고통받는 혼",       880, 25, 1, 1, 40, 100)},
            {33, new Monster(33, "망자의 절규",       900, 25, 1, 1, 40, 100)},

            //12컨셉-황금사과를 지키는 님프
            {34, new Monster(34, "님프A",       1100, 25, 1, 1, 40, 100)},
            {35, new Monster(35, "님프B",       1200, 25, 1, 1, 40, 100)},
            {36, new Monster(36, "님프C",       1300, 25, 1, 1, 40, 100)},




            //========보스몹===============

            {100, new Monster(100, "크레타의 황소", 150, 35, 10, 10, 100, 350)},
            {200, new Monster(200, "에리만토스의 멧돼지", 300, 35, 10, 10, 100, 550)},
            {300, new Monster(300, "디오메데스의 식인 말", 500, 35, 10, 10, 100, 800)},
            {400, new Monster(400, "아르테미스의 흰 암사슴", 800, 35, 10, 10, 100, 1000)},
            {500, new Monster(500, "아우게이아스의 괴물 가축", 1200, 35, 10, 10, 100, 1250)},
            {600, new Monster(600, "스팀팔로스의 청동 괴조", 1500, 35, 10, 10, 100, 1600)},
            {700, new Monster(700, "여왕 히폴리테", 150, 35, 10, 10, 100, 350)},
            {800, new Monster(800, "네메아의 사자", 150, 35, 10, 10, 100, 350)},
            {900, new Monster(900, "괴물왕 게리온", 150, 35, 10, 10, 100, 350)},
            {1000, new Monster(1000, "히드라", 150, 35, 10, 10, 100, 350)},
            {1100, new Monster(1100, "지옥의 문지기, 케르베로스", 150, 35, 10, 10, 100, 350)},
            {1200, new Monster(1200, "황금의 용, 라돈", 15000, 35, 10, 10, 100, 350)},

        };
    }
}
