using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using TextRPG.Entity;

namespace TextRPG.Data
{
    internal class MonsterDB
    {
        //몬스터 딕셔너리
        public static Dictionary<int, Monster> Monsters = new Dictionary<int, Monster>()
        {   //            id  이름            체 공 방 속도 exp gold

            //1컨셉-
            {1, new Monster(1, "더미1",       20, 20, 1, 1, 20, 50)},
            {2, new Monster(2, "더미2",       25, 22, 1, 1, 30, 80)},
            {3, new Monster(3, "더미3",       30, 25, 1, 1, 40, 100)},

            //2컨셉-
            {4, new Monster(4, "더미4",       30, 25, 1, 1, 40, 100)},
            {5, new Monster(5, "더미5",       30, 25, 1, 1, 40, 100)},
            {6, new Monster(6, "더미6",       30, 25, 1, 1, 40, 100)},

            //3컨셉-

            {7, new Monster(7, "더미7",       30, 25, 1, 1, 40, 100)},
            {8, new Monster(8, "더미8",       30, 25, 1, 1, 40, 100)},
            {9, new Monster(9, "더미9",       30, 25, 1, 1, 40, 100)},

            //4컨셉-

            {10, new Monster(10, "더미10",       30, 25, 1, 1, 40, 100)},
            {11, new Monster(11, "더미11",       30, 25, 1, 1, 40, 100)},
            {12, new Monster(12, "더미12",       30, 25, 1, 1, 40, 100)},

            //5컨셉-

            {13, new Monster(13, "더미13",       30, 25, 1, 1, 40, 100)},
            {14, new Monster(14, "더미14",       30, 25, 1, 1, 40, 100)},
            {15, new Monster(15, "더미15",       30, 25, 1, 1, 40, 100)},

            //6컨셉-

            {16, new Monster(16, "더미16",       30, 25, 1, 1, 40, 100)},
            {17, new Monster(17, "더미17",       30, 25, 1, 1, 40, 100)},
            {18, new Monster(18, "더미18",       30, 25, 1, 1, 40, 100)},

            //7컨셉-

            {19, new Monster(19, "더미19",       30, 25, 1, 1, 40, 100)},
            {20, new Monster(20, "더미20",       30, 25, 1, 1, 40, 100)},
            {21, new Monster(21, "더미21",       30, 25, 1, 1, 40, 100)},

            //8컨셉-

            {22, new Monster(22, "더미22",       30, 25, 1, 1, 40, 100)},
            {23, new Monster(23, "더미23",       30, 25, 1, 1, 40, 100)},
            {24, new Monster(24, "더미24",       30, 25, 1, 1, 40, 100)},

            //9컨셉-
            {25, new Monster(25, "더미25",       30, 25, 1, 1, 40, 100)},
            {26, new Monster(26, "더미26",       30, 25, 1, 1, 40, 100)},
            {27, new Monster(27, "더미27",       30, 25, 1, 1, 40, 100)},


            //10컨셉-
            {28, new Monster(28, "더미28",       30, 25, 1, 1, 40, 100)},
            {29, new Monster(29, "더미29",       30, 25, 1, 1, 40, 100)},
            {30, new Monster(30, "더미30",       30, 25, 1, 1, 40, 100)},

            //11컨셉-
            {31, new Monster(31, "더미31",       30, 25, 1, 1, 40, 100)},
            {32, new Monster(32, "더미32",       30, 25, 1, 1, 40, 100)},
            {33, new Monster(33, "더미33",       30, 25, 1, 1, 40, 100)},

            //12컨셉-
            {34, new Monster(34, "더미34",       30, 25, 1, 1, 40, 100)},
            {35, new Monster(35, "더미35",       30, 25, 1, 1, 40, 100)},
            {36, new Monster(36, "더미36",       30, 25, 1, 1, 40, 100)},




            //========보스몹===============

            {101, new Monster(101, "보스더미1", 150, 35, 10, 10, 100, 350)},
            {102, new Monster(102, "보스더미2", 150, 35, 10, 10, 100, 350)},
            {103, new Monster(103, "보스더미3", 150, 35, 10, 10, 100, 350)},
            {104, new Monster(104, "보스더미4", 150, 35, 10, 10, 100, 350)},
            {105, new Monster(105, "보스더미5", 150, 35, 10, 10, 100, 350)},
            {106, new Monster(106, "보스더미6", 150, 35, 10, 10, 100, 350)},
            {107, new Monster(107, "보스더미7", 150, 35, 10, 10, 100, 350)},
            {108, new Monster(108, "보스더미8", 150, 35, 10, 10, 100, 350)},
            {109, new Monster(109, "보스더미9", 150, 35, 10, 10, 100, 350)},
            {110, new Monster(110, "보스더미10", 150, 35, 10, 10, 100, 350)},
            {111, new Monster(111, "보스더미11", 150, 35, 10, 10, 100, 350)},
            {112, new Monster(112, "보스더미12", 150, 35, 10, 10, 100, 350)},

        };
    }
}
